IDENTIFICATION DIVISION.
PROGRAM-ID. PerformUntilExample.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 COUNTER    PIC 9(2) VALUE 0.

PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM UNTIL COUNTER >= 10
        DISPLAY "Counter: " COUNTER
        ADD 1 TO COUNTER
    END-PERFORM.
    
    STOP RUN.